In [23]:
import pandas as pd
import numpy as np

In [24]:
# Read the data
url = "https://storage.googleapis.com/kagglesdsdata/datasets/311509/632006/datatest.txt?X-Goog-Algorithm=GOOG4-RSA-SHA256&X-Goog-Credential=gcp-kaggle-com%40kaggle-161607.iam.gserviceaccount.com%2F20230709%2Fauto%2Fstorage%2Fgoog4_request&X-Goog-Date=20230709T194137Z&X-Goog-Expires=259200&X-Goog-SignedHeaders=host&X-Goog-Signature=2fe80d7b91829643bbc4965688fbec0956596e188aa3365a56be6721a3cfbd64c3cbdcd7f9193dc8d53f45672c1ab9cfc1a2eae42956ac0f45051f1aad1d66296df2a6847b3338f65698caf6b70c2564445f2c31702540b9e9b23a67166b5f3e945c1e3c85689a099ff9d9563625f682cbf43aeb1f193663ee3477f0814ad341249b4d4a311dd4687e0f6068966fc9171ba7b6679d501634fba0c7a5c2bc68eacafcf2de3362b896decf778ff7de642f5b4fd0c27d25cf93105b340d573dd1480ea440dfd5d77bc579773b8a5780bdbf42c5724d4cdf080d4907f44dc0a68e4832e1be83fb22e7ecb3cf494fafcb20e0bc7614c6740b9b6d160a1bdaa84489fb"
# Read the online file into a pandas DataFrame
df = pd.read_csv(url, sep=",")
# Display the first few rows of the DataFrame
df.head()

,date,Temperature,Humidity,Light,CO2,HumidityRatio,Occupancy
140,2015-02-02 14:19:00,23.7000,26.272,585.200000,749.200000,0.004764,1
141,2015-02-02 14:19:59,23.7180,26.290,578.400000,760.400000,0.004773,1
142,2015-02-02 14:21:00,23.7300,26.230,572.666667,769.666667,0.004765,1
143,2015-02-02 14:22:00,23.7225,26.125,493.750000,774.750000,0.004744,1
144,2015-02-02 14:23:00,23.7540,26.200,488.600000,779.000000,0.004767,1

In [25]:
null_counts = df.isnull().sum()
null_counts

date             0
Temperature      0
Humidity         0
Light            0
CO2              0
HumidityRatio    0
Occupancy        0
dtype: int64

In [26]:
def daily_value_counts(df, date_column):
    df[date_column] = pd.to_datetime(df[date_column])
    daily_counts = df.groupby([df[date_column].dt.date]).size().reset_index(name='count')
    return daily_counts

In [27]:
daily_counts = daily_value_counts(df, 'date')
daily_counts

         date  count
0  2015-02-02    581
1  2015-02-03   1440
2  2015-02-04    644

In [28]:
cal_cities = pd.read_csv("cal_cities_lat_long.csv")
cal_pops_cities = pd.read_csv("cal_populations_city.csv")

In [29]:
cal_cities.head()

           Name   Latitude   Longitude
0      Adelanto  34.582769 -117.409214
1  Agoura Hills  34.153339 -118.761675
2       Alameda  37.765206 -122.241636
3        Albany  37.886869 -122.297747
4      Alhambra  34.095286 -118.127014

In [30]:
cal_pops_cities.head()

,County,City,Incorportation_date,pop_april_1980,pop_april_1990,pop_april_2000,pop_april_2010
0,San Bernardino,Adelanto,1970,2164.0,8517,18130,31765
1,Los Angeles,Agoura Hills,1982,NaN,20390,20537,20330
2,Alameda,Alameda,1854,63852.0,76459,72259,73812
3,Alameda,Albany,1908,15130.0,16327,16444,18539
4,Los Angeles,Alhambra,1903,64767.0,82106,85804,83089

In [31]:
# join cal_cities and cal_pops_cities
cal_cities_pops = cal_cities.merge(cal_pops_cities, left_on='Name', right_on='City', how='left')
cal_cities_pops.head()

,Name,Latitude,Longitude,County,City,Incorportation_date,pop_april_1980,pop_april_1990,pop_april_2000,pop_april_2010
0,Adelanto,34.582769,-117.409214,San Bernardino,Adelanto,1970,2164.0,8517.0,18130.0,31765.0
1,Agoura Hills,34.153339,-118.761675,Los Angeles,Agoura Hills,1982,NaN,20390.0,20537.0,20330.0
2,Alameda,37.765206,-122.241636,Alameda,Alameda,1854,63852.0,76459.0,72259.0,73812.0
3,Albany,37.886869,-122.297747,Alameda,Albany,1908,15130.0,16327.0,16444.0,18539.0
4,Alhambra,34.095286,-118.127014,Los Angeles,Alhambra,1903,64767.0,82106.0,85804.0,83089.0

In [32]:
# restart
cal_cities = pd.read_csv("cal_cities_lat_long.csv")
cal_pops_cities = pd.read_csv("cal_populations_city.csv")

In [33]:
# Rename columns
cal_cities.rename(columns={'Name': 'City'}, inplace=True)

In [34]:
key_counts_df1_before = cal_cities.groupby('City').size() 
duplicated_keys_df1_before = key_counts_df1_before[key_counts_df1_before > 1] 

key_counts_df2_before = cal_cities_pops.groupby('City').size() 
duplicated_keys_df2_before = key_counts_df2_before[key_counts_df2_before > 1] 

new_df = pd.merge(cal_cities, cal_pops_cities, on='City', how='left')

key_counts_df_after = new_df.groupby('City').size() 
duplicated_keys_df_after = key_counts_df_after[key_counts_df_after > 1]

In [38]:
duplicated_keys_df_after

Series([], dtype: int64)

In [39]:
duplicated_keys_df1_before

Series([], dtype: int64)

In [40]:
duplicated_keys_df2_before

Series([], dtype: int64)